<div>
    <b>変更履歴</b>
    <dl>
        <dt>07/10 18:18</dt>
        <dd>キー操作は canvas 内にマウスポインタがあるときだけ反応する</dd>
        <dt>07/10 17:17</dt>
        <dd>一時的にwasmをオフにするチェックボックス。編集中は便利かも</dd>
        <dt>07/10 14:03</dt>
        <dd>デフォルトで勝手に一番良い solution を表示させる</dd>
        <dt>07/10 12:55</dt>
        <dd>Undo/Redo が出来る</dd>
        <dt>07/10 10:41</dt>
        <dd>Scoreにバグがあったのを修正</dd>
        <dt>07/10 03:25</dt>
        <dd>Shift+マウスドラッグで演奏者を動かせる</dd>
        <dt>07/10 02:02</dt>
        <dd>ジャッジサーバにスコアが入ってるときは wasm しない</dd>
        <dt>07/10 01:51</dt>
        <dd>ステージだけが大体見渡せる領域をデフォルトにした</dd>
        <dt>07/10 01:35</dt>
        <dd>volume の対応</dd>
        <dt>07/10 00:50くらい</dt>
        <dd>URL の末尾の ?solution_id を見ます</dd>
        <dt>07/10 00:00</dt>
        <dd>問題番号とかスコアとかのログ情報がいつも canvas 左上に表示される</dd>
        <dt>07/09 19:04</dt>
        <dd>
            チェックボックス Solution JSON で選んだソリューションの表示ができる。 編集して show
            solution したらそれも反映できる
        </dd>
        <dt>07/09 17:21</dt>
        <dd>表示される提出一覧の上限を8くらいに絞った, 重複も勝手に取り除いてる</dd>
        <dt>07/09 17:21</dt>
        <dd>オブジェクト (音楽家/観客/柱) をクリックすると最低限の情報が左上に表示される</dd>
        <dt>07/09 17:00くらい</dt>
        <dd>download solution ボタンが生えました</dd>
        <dt>07/09 16:28</dt>
        <dd>
            トップページ https://icfpc2023.negainoido.com はダミーになりました.
            https://icfpc2023.negainoido.com/1 のような問題ごとのページが生えてます
        </dd>
        <dt>07/09 15:36</dt>
        <dd>URL の末尾が <code>/[problem_id]</code> になってます</dd>
        <dt>07/09 13:21</dt>
        <dd>画面の真ん中を固定にしてちゃんと拡大縮小します</dd>
        <dt>07/09 12:46</dt>
        <dd>表示リセットは 0 (ゼロ) キー</dd>
        <dt>07/09 12:32</dt>
        <dd>ミュージシャンは常に半径 5 で表示される。観客はちっちゃい点のままです</dd>
        <dt>07/09 12:30</dt>
        <dd>ミュージシャンの色付け・罫線の表示切り替えもキー (C/R) でできる</dd>
        <dt>07/09 12:29</dt>
        <dd>拡大縮小・視点の移動ができる。スライダーまたはキー(WASD/QE)</dd>
    </dl>
</div>
