<script>
</script>

<div>
    <b>変更履歴</b>
    <dl>
        <dt>07/09 16:28</dt>
        <dd>トップページ
            https://icfpc2023.negainoido.com
            はダミーになりました.
            https://icfpc2023.negainoido.com/1
            のような問題ごとのページが生えてます
        </dd>
        <dt>07/09 15:36</dt>
        <dd>URL の末尾が <code>/[problem_id]</code> になってます</dd>
        <dt>07/09 13:21</dt>
        <dd>画面の真ん中を固定にしてちゃんと拡大縮小します</dd>
        <dt>07/09 12:46</dt>
        <dd>表示リセットは 0 (ゼロ) キー</dd>
        <dt>07/09 12:32</dt>
        <dd>ミュージシャンは常に半径 5 で表示される。観客はちっちゃい点のままです</dd>
        <dt>07/09 12:30</dt>
        <dd>ミュージシャンの色付け・罫線の表示切り替えもキー (C/R) でできる</dd>
        <dt>07/09 12:29</dt>
        <dd>拡大縮小・視点の移動ができる。スライダーまたはキー(WASD/QE)</dd>
    </dl>
</div>
